/*==========================================================================*/
/*==========================================================================*/
/*!
	@file		ZRenderShader.cpp
	@brief		Z値レンダリングシェーダ
	@author		shiba
	@date		2012/10/7 create this file.

*/
/*==========================================================================*/
/*==========================================================================*/
#include "ZRenderShader.h"
#include "FrameWork/DXUtil/UtilDX11.h"

//---------------------------------------------------------------------------
/*!
	@brief	コンストラクタ
*/
//---------------------------------------------------------------------------
CZRenderShader::CZRenderShader()
{
	m_eShaderID = CShaderManager::eSHADERID_ZRENDER;
}

//---------------------------------------------------------------------------
/*!
	@brief	デストラクタ
*/
//---------------------------------------------------------------------------
CZRenderShader::~CZRenderShader()
{
}

//---------------------------------------------------------------------------
/*!
	@brief	シェーダロード
*/
//---------------------------------------------------------------------------
HRESULT CZRenderShader::LoadShader()
{
	HRESULT hr = S_OK;

	LoadVertexShader();	//頂点シェーダはMRTシェーダの使いまわし
#if !defined(WRITEZ_HARDWARE_TEST)
	CreateShader(_T("Debug/ZRender_PS.cso"), CShaderManager::eSHADERTYPE_PIXEL);
#endif
	return hr;
}


//EOF