#pragma once

#include "FrameWork/Rendering/Sprite.h"

/*==========================================================================*/
/*==========================================================================*/
/*!
	@file		BlurSprite.h
	@brief		ブラー用スプライト
	@author		shiba
	@date		2012/3/3 create this file.
*/
/*==========================================================================*/
/*==========================================================================*/
class CBlurSprite : public CSprite
{
public:
	virtual void Draw();
};

//EOF
