#pragma once

#include "FrameWork/Rendering/Sprite.h"

/*==========================================================================*/
/*==========================================================================*/
/*!
	@file		DefferedSprite.h
	@brief		デファード用スプライト
	@author		shiba
	@date		2012/3/3 create this file.
*/
/*==========================================================================*/
/*==========================================================================*/
class CDefferedSprite : public CSprite
{
public:
	virtual void Draw();
};

//EOF
